11
# CTRL+ALT+T-команда открытия терминала (В спотлайт вводим Terminal)

# ~ - cимвол домашней директории (папки)
# / - символ корневой директории (папки)
# .. - облзначают предыдущую дерикторию 
# .  - текущвя дериктория 

# 1. ls (list) выводит список всех директорий (папок) выводит список всех папок (директорий) и файлов в текущей рабочей директории   

# 2. cd (change directory) -> меняет текущую директорию (папку) на указанную  (cd <название директории)

# 3 .touch -> создаёт указанный файл (touch <name_of_file>)

# 4. pwd (present working directory) -> выводит путь до текущкй директории(папка)

# 5. mkdir (make directory) создаёт указанную директорию 

# 6. rmdir (remove directory) -> удаляет указанную директорию 


# 7. rm -rf (remove -remove forse) -> принудительное удаление 

# 8. rm <name_file> (remove file)->  удаление файла 

# 9. ls -a -> выводит список как скрытых так и обычных директорий и файлов 
 
# 10. ls -la -> выводит все списки директорий и файлов

# 11. cd + . +  <name_file_or_folder> -> создание скрытого 

# 12. nano <path_to_file> -> открывает -> покозать все файлы (скрытые тоже) открывает графический интерфейс для редактирования файла *если нет указанного файла, то создасться новый файл с таким именем 

# 13. cat <path_to_file> -> выводит содержимое файла 

# 14. mv -> rename file 

# 15. clear -> чистка терминала 

# 16. history -> история кодов

# mkdir makers && cd makers && touch makers.txt

# 17. du (disk usage использование диска) -> выводит все директории и поддиректории текущей директории

# 18. gnome-system-monitor -> диспетчер задач
